#include <stdio.h>
#include <stdlib.h>

int main(void) {

//有符号和无符号的区别;
//使用%u是不记录符号的,无符号数字不能写负数;
//	printf("Number:%d,Unsigned Int:%u\n",12,17);

//%o指的是我们要输出一个八进制的数字;
//	printf("%o\n",8);

//0,1,2,3,4,5,6,7,8,9,10  十进制
//0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F,10 十六进制

//%x指的是我们要输出一个十六进制的数字;
//如果想输出15=f想把f输出为大写的需要把x改成大写X例%X;
//如果想输出一个颜色的值一般使用十六进制的%X或%u;
//	printf("%x,%X,red:%X\n",15,15,0xFFFF0000);

//浮点类型的值占位符为(f,F,e,E,g,G,a,A)
//如何任意 保留小数点后面的几位数需改(%f)为(%.2f)点几就是保留几位;
//	printf("%.2f\n",3.14);

//%c是输出一个字符用的;
//	printf("%c\n",'A');

//%s是输出一个字符串用的;
//	printf("%ss\n","Hello World");

//输出特定长度的整数;
//如何在输出一个数据时,前面没有值的话如何在前面补0;
//如果是一个三位的整数需要在%d中间加%03d,如果输出的值为三位数03无效;
//如果不在3前面写零那么将会补上空格;
	printf("%03d\n",7);



	return EXIT_SUCCESS;
}
